added more in depth content, better render of workflow charts, curves and mathematical formula
